import java.util.*;
public class Menu_prop {
    // 第一引数：品目、第二引数：群、第三引数：メニュー
    public static final String[][][] menu = {{{"おろしハンバーグ", "おろし唐揚げ", "豚キムチ炒め", "アジのエスカベッシュ", "あじフライ"}, 
                                            {"揚げだし豆腐", "肉じゃが", "かぼちゃコロッケ", "スパイシーポテト", "豚キムチ炒め"},
                                            {"白身魚フライ（タルタル）", "クリームチーズ入りメンチ", "アジのエスカベッシュ", "チキン南蛮", "パリパリ春巻き"}},
                                            {{"半熟卵", "ツナサラダ", "冷奴", "薩摩ハーブ鶏のレバー煮", "煮卵"},
                                            {"ポテト＆コーンサラダ", "ハッシュポテト", "切干大根", "とろろ", "15品目のヘルシーサラダ"},
                                            {"いももち", "春雨サラダ（しそ風味）", "竹輪の磯部揚げ", "マカロニサラダ", "ハッシュポテト"}},
                                            {{"きつねそば", "きつねうどん", "冷やし中華", "濃厚煮干しラーメン", "釜玉そば"},
                                            {"冷やし担々麺", "味噌ラーメン", "辛味噌ラーメン", "かき揚げそば", "かき揚げうどん"},
                                            {"辛味噌ラーメン", "濃厚煮干しラーメン", "味噌ラーメン", "冷やしラーメン", "冷やし中華"}},
                                            {{"チキン竜田丼","辛みそ豚丼","スタミナ焼肉丼","ハンバーグステーキ丼","ネギ塩唐揚げ丼"},
                                            {"蒸し鶏の和風ねばねば丼","天丼","スタミナ焼肉丼","かき揚げ天丼(小エビ入り)","サーモンサラダプレート"},
                                            {"かき揚げ天丼(小エビ入り)","カツカレー","天丼","ヒレカツカレー","ハンバーグステーキ丼"}}};


    public String[] proposal(int min_color) {
        String[] prop = new String[4];
        Random random = new Random();
        
        for (int i = 0; i < 4; i++) {
            int rand = random.nextInt(5);
            prop[i] = menu[i][min_color][rand];
        }

        return prop;
    }

    public static void main(String[] args) {
    }
}